CHANEL_LINKS = [
    'https://t.me/buenas_hatas',
    'https://t.me/alquilar_BuenosAires',
    'https://t.me/arendaArgentinaprop',
    'https://t.me/fromtestchannel',
    # 'https://t.me/argentinarentchat',
    'https://t.me/ruargentinadom',
    'https://t.me/alquilertemporariobsas',
    'https://t.me/argentina_apartamentos',
    'https://t.me/ArgentinaHouse',
    'https://t.me/arendacaba',
    'https://t.me/apartment_in_Buenos_Aires',
    'https://t.me/alquilertemporario2022',
    'https://t.me/+xVFErK_4YHIzNzEy'
]

TOPICS = [
    'ruargentinadom/19956',
    'ruargentinadom/15746',
    'argentina_apartamentos/3934'
]

ONE_ROOM = [
    'комнаты:1',
    'комнат:1',
    'студия',
    'однокомнатная',
    '1-комнатная',
    '1-комнатную',
    '1комнатная',
    '1хкомнатная',
    '1кквартира',
    'однокомнатные'
]
TWO_ROOM = [
    'комнаты:2',
    'комнат:2',
    '2комнаты',
    '2кквартира',
    '2-комнатная',
    '2-комнатную',
    'двухкомнатная',
    '2хкомнатная',
    'двушка',
    '3-ка',
    '2-хкомнатная',
    '2-хкомнатный',
    'двушке',
    '2комнатная',
    '2хкомнатную'
]
THREE_ROOM = [
    'комнаты:3',
    'комнат:3',
    '3комнаты',
    '3кквартира',
    '3-комнатная',
    '3-комнатную',
    'трёхкомнатная',
    'трехкомнатная',
    '3хкомнатная',
    'трешка',
    'трёшка',
    '3-хкомнатную',
    '3-хкомнатная',
    '3просторныекомнаты',
    '3-комнатной',
    '3комнатная',
    '3хкомнатную',
    '3хкомнатный'
]
FOUR_ROUM = [
    'комнаты:4',
    'комнат:4',
    '4комнаты',
    '4кквартира',
    '4-комнатная',
    '4-комнатную',
    '4хкомнатная',
    '4-хкомнатных',
    '4хкомнатный',
    '5икомнатная квартира',
    'комнат:5',
    '5комнат',
    '5комнатная'
]

BLACK_LIST = [
    '‼️ показываем сегодня ‼️',
    'RuArgentina'
]

WHITE_LIST = [
    'квартира',
    'посредник',
    'район',
    'лофт',
    'кухня',
    'апартаменты',
    'аренд'
]

YES_MASCOTAS = [
    'можносживотными',
    'можносдетьмииживотными',
    'можносмаленькимживотным',
    'животныеобсуждаемы',
    'животныеобсуждаются',
    'подходитдлясемейсдомашнимиживотными',
    'можносживотным',
    'можноснебольшимдомашнимживотным',
    'домашнееживотноепринимается',
    'небольшимживотным',
    'можносдомашнимиживотными',
    'животноепринимается'
]

ALL_LIST = ONE_ROOM + TWO_ROOM + THREE_ROOM + FOUR_ROUM + WHITE_LIST
